<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png">

In [1]:
'''
What is Pandas?
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.


Pandas : Powerful for data analysis

Pandas stands for “Python Data Analysis Library”

one of the most preferred and widely used tools in Data munging / Wrangling


Data wrangling —also called data cleaning, data remediation, 
or data munging —refers to a variety of processes designed to transform raw data into more readily used formats

https://pandas.pydata.org/docs/reference/general_functions.html



The major outcomes of panda are:

        1) analysis of data

        2) preparation of data

        3) data manipulation

        4) data modeling

        5) data analysis
'''

'\nWhat is Pandas?\nPandas is a Python library used for working with data sets.\n\nIt has functions for analyzing, cleaning, exploring, and manipulating data.\n\nWhy Use Pandas?\nPandas allows us to analyze big data and make conclusions based on statistical theories.\n\nPandas can clean messy data sets, and make them readable and relevant.\n\nRelevant data is very important in data science.\n\n\nPandas : Powerful for data analysis\n\nPandas stands for “Python Data Analysis Library”\n\none of the most preferred and widely used tools in Data munging / Wrangling\n\n\nData wrangling —also called data cleaning, data remediation, \nor data munging —refers to a variety of processes designed to transform raw data into more readily used formats\n\n\n\nThe major outcomes of panda are:\n\n        1) analysis of data\n\n        2) preparation of data\n\n        3) data manipulation\n\n        4) data modeling\n\n        5) data analysis\n'

<img src="https://miro.medium.com/max/1532/1*CuHNQWNiCnwIpGKZQO91bg.png">

In [3]:
#!pip install pandas
import pandas as pd
import numpy as np

In [4]:
'''
What is a Series?
A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.
'''
s1 = pd.Series([23,24,25,'12',32])
s1

0    23
1    24
2    25
3    12
4    32
dtype: object

<img src="https://1.bp.blogspot.com/-AkAiqQBMhvM/XJiYR2xWg-I/AAAAAAAAAIo/wXoFEgnKbhQbpEy_o5XxAYY5uA0y97hOQCLcBGAs/w1200-h630-p-k-no-nu/pandas-powerful-data-analysis-tools-for-python-13-638.jpg">

In [5]:
s2 = pd.Series([23,45,67,12,34],index = ['a','b','c','d','e'])
s2

a    23
b    45
c    67
d    12
e    34
dtype: int64

In [6]:
s3 = pd.Series([23,45,67,12,34],index = ['a','b','c','d','e'],dtype = 'float')
s3

a    23.0
b    45.0
c    67.0
d    12.0
e    34.0
dtype: float64

In [6]:
'''
Labels
If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

This label can be used to access a specified value.'''
s3['a']

23.0

### creation of Series using dictionary

In [9]:
s4 = pd.Series({'a':65,'b':43,'c':45})
s4

a    65
b    43
c    45
dtype: int64

### DataFrame
What is a DataFrame?
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

<img src="https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png">

In [10]:
d1 = pd.DataFrame([43,54,65,76])
d1

    0
0  43
1  54
2  65
3  76

In [11]:
d2 = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]])
d2

   0  1  2
0  2  3  4
1  4  5  6
2  1  2  3

In [12]:
d2 = pd.DataFrame(s2)  #converting series into dataframe
d2

    0
a  23
b  45
c  67
d  12
e  34

In [13]:
d3  = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]],columns =['a','b','c'])
d3

   a  b  c
0  2  3  4
1  4  5  6
2  1  2  3

In [14]:
d3  = pd.DataFrame([[2,3,4],[4,5,6],[1,2,3]],columns =['a','b','c'],index = ['x','y','z'])
d3

   a  b  c
x  2  3  4
y  4  5  6
z  1  2  3

In [13]:
#pd.DataFrame?

### creating DataFrame from list of dictionaries

In [21]:
dic = [{'alex':1,'joe':2},{'ema':5,'dora':10,'alice':20}]    
pd.DataFrame(dic,index=['a','b'])

   alex  joe  ema  dora  alice
a   1.0  2.0  NaN   NaN    NaN
b   NaN  NaN  5.0  10.0   20.0

In [35]:

p=pd.DataFrame({'alex':{'h':'2'},'joe':{'f':'4'}})
p

  alex  joe
h    2  NaN
f  NaN    4

### DataFrame operations

In [27]:
d3

   a  b  c
x  2  3  4
y  4  5  6
z  1  2  3

In [28]:
d3['a']

x    2
y    4
z    1
Name: a, dtype: int64

In [17]:
d3['d']=d3['a']*d3['b']
d3['e']=d3['a']+d3['d']
d3

   a  b  c   d   e
x  2  3  4   6   8
y  4  5  6  20  24
z  1  2  3   2   3

In [18]:
pop = d3.pop('b') 
d3

   a  c   d   e
x  2  4   6   8
y  4  6  20  24
z  1  3   2   3

In [19]:
d3

   a  c   d   e
x  2  4   6   8
y  4  6  20  24
z  1  3   2   3

In [20]:
del d3['d']

In [21]:
d3

   a  c   e
x  2  4   8
y  4  6  24
z  1  3   3

In [22]:
d3.pop('a')
d3

   c   e
x  4   8
y  6  24
z  3   3

In [23]:
d3.insert(1,'new1',d3['c'])#(loc,colm,data)
d3

   c  new1   e
x  4     4   8
y  6     6  24
z  3     3   3

In [24]:
import numpy as np
d4 = pd.DataFrame({'abc':np.random.randint(2,6,size = (10)),'bcd':np.random.randint(4,10,size = (10)),'cde':np.random.randint(3,10,size = (10))})
d4

   abc  bcd  cde
0    2    5    3
1    2    9    3
2    2    4    9
3    5    8    6
4    2    4    4
5    5    5    5
6    5    4    6
7    5    7    4
8    5    9    6
9    3    5    5

In [25]:
d4.head(6)

   abc  bcd  cde
0    2    5    3
1    2    9    3
2    2    4    9
3    5    8    6
4    2    4    4
5    5    5    5

In [26]:
d4.tail()

   abc  bcd  cde
5    5    5    5
6    5    4    6
7    5    7    4
8    5    9    6
9    3    5    5

In [27]:
'''
Info About the Data
The DataFrames object has a method called info(), that gives you more information about the data set.'''
d4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
 2   cde     10 non-null     int32
dtypes: int32(3)
memory usage: 248.0 bytes

<img src="https://vrzkj25a871bpq7t1ugcgmn9-wpengine.netdna-ssl.com/wp-content/uploads/2019/02/pandas-loc-get-specific-column-syntax.png">

In [28]:
d4

   abc  bcd  cde
0    2    5    3
1    2    9    3
2    2    4    9
3    5    8    6
4    2    4    4
5    5    5    5
6    5    4    6
7    5    7    4
8    5    9    6
9    3    5    5

In [29]:
d4.loc[9,'cde'] #loc[row name,colname]

5

In [30]:
d4.loc[4:9,['abc','cde']]

   abc  cde
4    2    4
5    5    5
6    5    6
7    5    4
8    5    6
9    3    5

In [31]:
d4.loc[[3,4,7],['abc','cde']]

   abc  cde
3    5    6
4    2    4
7    5    4

In [32]:
d4

   abc  bcd  cde
0    2    5    3
1    2    9    3
2    2    4    9
3    5    8    6
4    2    4    4
5    5    5    5
6    5    4    6
7    5    7    4
8    5    9    6
9    3    5    5

<img src='https://www.marsja.se/wp-content/uploads/2019/09/pandas_select_row_by_index_iloc.png'>

In [33]:
d4.iloc[9,2]  #[row index,column index]

5

In [34]:
d4.iloc[2:7,[0,2]]

   abc  cde
2    2    9
3    5    6
4    2    4
5    5    5
6    5    6

In [35]:
d4.abc

0    2
1    2
2    2
3    5
4    2
5    5
6    5
7    5
8    5
9    3
Name: abc, dtype: int32

In [36]:
d4.abc.values

array([2, 2, 2, 5, 2, 5, 5, 5, 5, 3])

In [37]:
d4['sum'] = d4.abc.values + d4.cde.values + d4.bcd.values
d4

   abc  bcd  cde  sum
0    2    5    3   10
1    2    9    3   14
2    2    4    9   15
3    5    8    6   19
4    2    4    4   10
5    5    5    5   15
6    5    4    6   15
7    5    7    4   16
8    5    9    6   20
9    3    5    5   13

In [38]:
a = [['rk',102,15000],['rama',103,20000],['krishna',104,25000]]
dfl = pd.DataFrame(a,columns = ['name','id','salary'])
dfl

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000

In [39]:
y=dfl[dfl.salary>=20000]
# print(y)
y[['id','salary']]

    id  salary
1  103   20000
2  104   25000

In [40]:
dfl.append({'name' : 'sajan','id' : 105,'salary' : 30000},ignore_index=True)

      name   id  salary
0       rk  102   15000
1     rama  103   20000
2  krishna  104   25000
3    sajan  105   30000

In [41]:
dfl = dfl.append({'name' : np.nan,'id' : 105,'salary' : 30000},ignore_index = True)
dfl

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0

In [42]:
dfl.isnull()

    name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3   True  False   False

In [43]:
dfl.isnull().sum()

name      1
id        0
salary    0
dtype: int64

In [44]:
dfl.dropna()

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0

In [45]:
dfl

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      NaN  105.0  30000.0

In [46]:
dfl.fillna(value = 'abc')

      name     id   salary
0       rk  102.0  15000.0
1     rama  103.0  20000.0
2  krishna  104.0  25000.0
3      abc  105.0  30000.0

### Groupby

<img src="https://th.bing.com/th/id/OIP.h5V2-wp2jL4Ip5FTRd6ThQAAAA?pid=ImgDet&rs=1">

In [47]:
df = pd.DataFrame({'Animal' : ['Falcon', 'Falcon','Parrot', 'Parrot'],'Max Speed' : [380., 370., 24., 26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [48]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [1]:
df_csv = pd.read_csv('data.csv')
df_csv                              #excel,#csv,#json,#pickle #pharmacy-diff format

NameError: name 'pd' is not defined

In [50]:
df_csv.columns

Index(['Unnamed: 0', 'COUNTRY', 'POP', 'AREA', 'GDP', 'CONT', 'IND_DAY'], dtype='object')

In [51]:
df_csv['COUNTRY'].values

array(['China', 'India', 'US', 'Indonesia', 'Brazil', 'Pakistan',
       'Nigeria', 'Bangladesh', 'Russia', 'Mexico', 'Japan', 'Germany',
       'France', 'UK', 'Italy', 'Argentina', 'Algeria', 'Canada',
       'Australia', 'Kazakhstan'], dtype=object)

In [52]:
df_csv['COUNTRY'].isnull().sum()

0

In [53]:
import pandas as pd
import numpy as np
 
df = pd.DataFrame(np.random.randn(4,3),columns=['col1','col2','col3'])
print(df)
print('\n')
for key,value in df.iteritems():
   print(key,value)
   print('\n')

       col1      col2      col3
0 -1.840811 -0.597114  1.798498
1 -0.361207 -0.642441 -1.536465
2  0.470485  0.073914 -0.086632
3 -0.225394 -0.062728 -0.363256


col1 0   -1.840811
1   -0.361207
2    0.470485
3   -0.225394
Name: col1, dtype: float64


col2 0   -0.597114
1   -0.642441
2    0.073914
3   -0.062728
Name: col2, dtype: float64


col3 0    1.798498
1   -1.536465
2   -0.086632
3   -0.363256
Name: col3, dtype: float64

In [54]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(3,3),columns = ['col1','col2','col3'])
print(df)
print('\n')
for row in df.iterrows():
   print(row)
   print('\n')

       col1      col2      col3
0 -1.060611  0.797911 -0.054563
1 -2.262294 -0.544912 -1.333897
2 -2.671592  0.002815 -0.416272


(0, col1   -1.060611
col2    0.797911
col3   -0.054563
Name: 0, dtype: float64)


(1, col1   -2.262294
col2   -0.544912
col3   -1.333897
Name: 1, dtype: float64)


(2, col1   -2.671592
col2    0.002815
col3   -0.416272
Name: 2, dtype: float64)

In [55]:
#pd.Series?

In [56]:
# Transpose
df.T

             0         1         2
col1 -1.060611 -2.262294 -2.671592
col2  0.797911 -0.544912  0.002815
col3 -0.054563 -1.333897 -0.416272

### Get Dummies

In [57]:
import pandas as pd

data = {'firstname': ['Arun', 'Jebu', 'Venkat', 'Rekha', 'Majid','Mohsin'], 
        'lastname': ['Kumar', 'Jacob', 'Raghavan', 'Singh', 'Khan','Khan'], 
        'employmenttype': ['Service', 'Business', 'Student', 'Service', 'Business','Business'],
        'country' :['India','USA','USA','Sweden','Australia','Germany']}


df = pd.DataFrame(data, columns = ['firstname','lastname','employmenttype','country'])

print(df)

  firstname  lastname employmenttype    country
0      Arun     Kumar        Service      India
1      Jebu     Jacob       Business        USA
2    Venkat  Raghavan        Student        USA
3     Rekha     Singh        Service     Sweden
4     Majid      Khan       Business  Australia
5    Mohsin      Khan       Business    Germany

In [58]:
df1 = pd.get_dummies(df['employmenttype'])
df2 = pd.get_dummies(df['country'])
print(df1)
print(df2)

   Business  Service  Student
0         0        1        0
1         1        0        0
2         0        0        1
3         0        1        0
4         1        0        0
5         1        0        0
   Australia  Germany  India  Sweden  USA
0          0        0      1       0    0
1          0        0      0       0    1
2          0        0      0       0    1
3          0        0      0       1    0
4          1        0      0       0    0
5          0        1      0       0    0

In [59]:
df

  firstname  lastname employmenttype    country
0      Arun     Kumar        Service      India
1      Jebu     Jacob       Business        USA
2    Venkat  Raghavan        Student        USA
3     Rekha     Singh        Service     Sweden
4     Majid      Khan       Business  Australia
5    Mohsin      Khan       Business    Germany

In [60]:
frames = [df,df1,df2]

result = pd.concat(frames,axis=1)
result

,firstname,lastname,employmenttype,country,Business,Service,Student,Australia,Germany,India,Sweden,USA
0,Arun,Kumar,Service,India,0,1,0,0,0,1,0,0
1,Jebu,Jacob,Business,USA,1,0,0,0,0,0,0,1
2,Venkat,Raghavan,Student,USA,0,0,1,0,0,0,0,1
3,Rekha,Singh,Service,Sweden,0,1,0,0,0,0,1,0
4,Majid,Khan,Business,Australia,1,0,0,1,0,0,0,0
5,Mohsin,Khan,Business,Germany,1,0,0,0,1,0,0,0

In [61]:
#task 42 explore sql joins
import pandas as pd

data1 = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

data2 = {
  "name": ["Sally", "Peter", "Micky"],
  "age": [77, 44, 22]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

newdf = df1.merge(df2, how='right')
print(newdf)                                   #innner #self

    name  age
0  Sally   77
1  Peter   44
2  Micky   22

## Joins

In [ ]:
df3=pd.merge(df1,df2,on="city",how="outer")
df3

In [ ]:
df3=pd.merge(df1,df2,on="city",how="left")
df3

In [ ]:
df3=pd.merge(df1,df2,on="city",how="right")
df3

## concatination

In [63]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [64]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [65]:
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [66]:
# ignore index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [67]:
# concatinate using keys
df = pd.concat([india_weather, us_weather], keys=["india", "us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [ ]:

'''
Finding Relationships
A great aspect of the Pandas module is the corr() method.

The corr() method calculates the relationship between each column in your data set.
'''

In [68]:
df.corr()

             temperature  humidity
temperature     1.000000 -0.009327
humidity       -0.009327  1.000000